---
kind: method
id: M:Autodesk.Revit.DB.DisplacementElement.GetDisplacedElementIds
source: html/653f228c-8b72-aa94-4ab0-131d1f1b322f.htm
---
# Autodesk.Revit.DB.DisplacementElement.GetDisplacedElementIds Method

The ids of the elements affected by this DisplacementElement.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetDisplacedElementIds()
```

## Returns
The element ids.